Model: "Sequential_20210508-155327"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 96)        2688      
_________________________________________________________________
dropout (Dropout)            (None, 32, 32, 96)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 96)        83040     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 16, 96)        83040     
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 96)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 192)       166080    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 192)       331968    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 192)         331968    
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 192)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 192)         331968    
_________________________________________________________________
activation (Activation)      (None, 8, 8, 192)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 192)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 192)         37056     
_________________________________________________________________
activation_1 (Activation)    (None, 8, 8, 192)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 192)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 2)           386       
_________________________________________________________________
global_average_pooling2d (Gl (None, 2)                 0         
_________________________________________________________________
activation_2 (Activation)    (None, 2)                 0         
=================================================================
Total params: 1,368,194
Trainable params: 1,368,194
Non-trainable params: 0
_________________________________________________________________
